# 결측치 실습

### 학습 목표
- 결측치에 대한 처리법을 익힌다.

In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series
from numpy import nan as NA

In [2]:
data = DataFrame([[1, 6, 3], [1, np.nan, NA], [NA, NA, NA], [NA, 5, 3]])
data

     0    1    2
0  1.0  6.0  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  5.0  3.0

In [3]:
# 결측치가 있는 행, 열 처리하기
# column별 결측치 수 확인 --> isnull()
data.isnull().sum()

0    2
1    2
2    2
dtype: int64

In [4]:
# 결측치가 있는 행, 열 처리하기
# 0번 column에서 결측치 index 찾기
data[data[0].isnull()].index

Index([2, 3], dtype='int64')

In [5]:
# 결측치가 있는 행, 열 처리하기
# 결측치 지우기 --> dropna()
data.dropna()  # axis = 0 가 defalt

     0    1    2
0  1.0  6.0  3.0

In [6]:
data

     0    1    2
0  1.0  6.0  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  5.0  3.0

In [7]:
# 특정 column을 기준으로 결측치 있는 행을 삭제, subset = ['column명']
data.dropna(subset = [0,2]) # 0 , 2 열에 결측치가 있는 행만 지워라

     0    1    2
0  1.0  6.0  3.0

In [8]:
# how = any 하나라도 결측치가 있는 행은 지워라
data.dropna(how = 'any')

     0    1    2
0  1.0  6.0  3.0

In [9]:
# how = all 모든 값이 결측치인 행은 지워라
data.dropna(how = 'all')

     0    1    2
0  1.0  6.0  3.0
1  1.0  NaN  NaN
3  NaN  5.0  3.0

In [10]:
# data[4] = np.array([1,2,3,4])
data[4] = [1,2,3,4]
data

     0    1    2  4
0  1.0  6.0  3.0  1
1  1.0  NaN  NaN  2
2  NaN  NaN  NaN  3
3  NaN  5.0  3.0  4

In [11]:
# 결축치 채우기 --> fillna()
data.fillna(0)

     0    1    2  4
0  1.0  6.0  3.0  1
1  1.0  0.0  0.0  2
2  0.0  0.0  0.0  3
3  0.0  5.0  3.0  4

In [12]:
# 결축치 채우기 --> fillna()
# 1 column의 결측치를 4 column의 평균값으로 채우기
# data[1].fillna(value=data[4].mean(), inplace=True)
data[1].fillna(data[4].mean(), inplace=True)
data

     0    1    2  4
0  1.0  6.0  3.0  1
1  1.0  2.5  NaN  2
2  NaN  2.5  NaN  3
3  NaN  5.0  3.0  4

In [13]:
# thresh --> 임계치, thresh = n, 정상치가 n개 이상인 행이나 열을 살려라
data.dropna(axis=0, thresh=3)

     0    1    2  4
0  1.0  6.0  3.0  1
1  1.0  2.5  NaN  2
3  NaN  5.0  3.0  4

In [14]:
df = DataFrame(np.random.rand(7,3)) 
df.iloc[:4, 1]= np.nan
df.iloc[:2, 2]= np.nan
df

          0         1         2
0  0.761294       NaN       NaN
1  0.188370       NaN       NaN
2  0.324179       NaN  0.340381
3  0.142894       NaN  0.378685
4  0.876774  0.246091  0.167589
5  0.140575  0.591394  0.848627
6  0.461517  0.036091  0.009973

In [15]:
# 결측치 채우기
df.fillna(method='bfill')

          0         1         2
0  0.761294  0.246091  0.340381
1  0.188370  0.246091  0.340381
2  0.324179  0.246091  0.340381
3  0.142894  0.246091  0.378685
4  0.876774  0.246091  0.167589
5  0.140575  0.591394  0.848627
6  0.461517  0.036091  0.009973

In [16]:
# 결측치 있는 label 제거
df.dropna()

          0         1         2
4  0.876774  0.246091  0.167589
5  0.140575  0.591394  0.848627
6  0.461517  0.036091  0.009973

In [17]:
# 정상치가 2개 이상인 행은 살리기
df.dropna(thresh=2)

          0         1         2
2  0.324179       NaN  0.340381
3  0.142894       NaN  0.378685
4  0.876774  0.246091  0.167589
5  0.140575  0.591394  0.848627
6  0.461517  0.036091  0.009973

In [18]:
# 결측치가 2개 이상인 label만 제거

In [19]:
# 결측치를 0으로 채우기

df.fillna(0)

          0         1         2
0  0.761294  0.000000  0.000000
1  0.188370  0.000000  0.000000
2  0.324179  0.000000  0.340381
3  0.142894  0.000000  0.378685
4  0.876774  0.246091  0.167589
5  0.140575  0.591394  0.848627
6  0.461517  0.036091  0.009973

In [20]:
# 1번 열의 결측치는 0.5로, 2번 열의 결측치는 0으로 채우기 --> Dictionary
fill_dict = {1:0.5, 2:0 }
# df.fillna(value=fill_dict)
df.fillna(fill_dict)

          0         1         2
0  0.761294  0.500000  0.000000
1  0.188370  0.500000  0.000000
2  0.324179  0.500000  0.340381
3  0.142894  0.500000  0.378685
4  0.876774  0.246091  0.167589
5  0.140575  0.591394  0.848627
6  0.461517  0.036091  0.009973

In [21]:
# 1번 열의 결측치는 0.5로, 2번 열의 결측치는 0으로 채우기 --> Dictionary
# fill_dict = {1:0.5, 2:0 }
# df.fillna(value=fill_dict)
df.fillna({1:0.5, 2: df[0].mean()})

          0         1         2
0  0.761294  0.500000  0.413658
1  0.188370  0.500000  0.413658
2  0.324179  0.500000  0.340381
3  0.142894  0.500000  0.378685
4  0.876774  0.246091  0.167589
5  0.140575  0.591394  0.848627
6  0.461517  0.036091  0.009973

In [22]:
df = DataFrame(np.random.rand(6,3)) 
df.iloc[2:, 1]= np.nan
df.iloc[4:, 2]= np.nan
df

          0         1         2
0  0.413910  0.192063  0.222531
1  0.043417  0.567592  0.190147
2  0.869638       NaN  0.966899
3  0.866744       NaN  0.374295
4  0.124466       NaN       NaN
5  0.126861       NaN       NaN

In [23]:
# 열 전체 결측치를 ffill로 채우기

df.fillna(method='ffill')

          0         1         2
0  0.413910  0.192063  0.222531
1  0.043417  0.567592  0.190147
2  0.869638  0.567592  0.966899
3  0.866744  0.567592  0.374295
4  0.124466  0.567592  0.374295
5  0.126861  0.567592  0.374295

In [24]:
# 결측치 ffill로 채우기
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.413910  0.192063  0.222531
1  0.043417  0.567592  0.190147
2  0.869638  0.567592  0.966899
3  0.866744  0.567592  0.374295
4  0.124466       NaN  0.374295
5  0.126861       NaN  0.374295

In [25]:
# 이상치 제거하기 

# 설문조사(성별 --> 0, 1,만족도(5점 척도) --> 1 ~ 5)
df = pd.DataFrame({'sex': [0,1,1,1,3,1], 'score':[1, 5, 4, 3, 2, 7]})
df

   sex  score
0    0      1
1    1      5
2    1      4
3    1      3
4    3      2
5    1      7

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sex     6 non-null      int64
 1   score   6 non-null      int64
dtypes: int64(2)
memory usage: 224.0 bytes

In [27]:
# np.where() --> np.where(조건, 4, 2)
df['sex'] = np.where((df['sex'] != 0) & (df['sex'] != 1), np.nan, df['sex'])
df

   sex  score
0  0.0      1
1  1.0      5
2  1.0      4
3  1.0      3
4  NaN      2
5  1.0      7

In [28]:
df['score'] = np.where(df['score'] > 5, np.nan, df['score'])
df

   sex  score
0  0.0    1.0
1  1.0    5.0
2  1.0    4.0
3  1.0    3.0
4  NaN    2.0
5  1.0    NaN

In [29]:
# df.dropna()
df.dropna(subset=['sex', 'score'])

   sex  score
0  0.0    1.0
1  1.0    5.0
2  1.0    4.0
3  1.0    3.0

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sex     5 non-null      float64
 1   score   5 non-null      float64
dtypes: float64(2)
memory usage: 224.0 bytes

In [31]:
df = pd.read_csv('../Data/mpg.csv')

In [32]:
df

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
229,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
230,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
231,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
232,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
233,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 234 entries, 0 to 233
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  category      234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 20.2+ KB

In [34]:
# value_count() --> column에 value 종류, 각 value별 sample수(분포)
df.drv.value_counts()

drv
f    106
4    103
r     25
Name: count, dtype: int64

In [39]:
# 고속도로 연비가 40에서 45사이인 sample의 데이터를 보고 싶다면?
# df[(df.hwy >= 40) & (df.hwy <= 45)]
df[df.hwy >= 40][df.hwy <= 45]

/tmp/ipykernel_549/1062065366.py:3: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[df.hwy >= 40][df.hwy <= 45]

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category
212,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact
221,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact
222,volkswagen,new beetle,1.9,1999,4,auto(l4),f,29,41,d,subcompact

In [48]:
# query() --> 조건걸어주는 명령어
# df.query('40 <= hwy <= 45')
# df.query('hwy >=40 and hwy < 46')
# df.query('hwy >=40 & hwy < 46')
df.query('hwy >=40').query('hwy < 46')

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category
212,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact
221,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact
222,volkswagen,new beetle,1.9,1999,4,auto(l4),f,29,41,d,subcompact

In [50]:
# mpg = (cty + hwy)/2 라는 column을 만들고
df['mpg'] = (df.cty + df.hwy)/2
df

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,mpg
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...
229,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,23.5
230,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,25.0
231,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,21.0
232,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,22.0
233,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,21.5

In [54]:
# np.where('조건', '참값', '거짓값') 사용
# Q. mpg가 20이상이면 'OK', 그렇지 않으면 'Fail'

df['test'] = np.where(df['mpg'] >= 20, 'OK', 'Fail')
df['test'].value_counts()

test
OK      128
Fail    106
Name: count, dtype: int64

In [61]:
# mpg >= 30 : A, 20~29: B, 20미만: C
# grade 컬럼을 만들어서 value 할당
df['grade'] = np.where(df['mpg'] >= 30, 'A', np.where(df['mpg'] < 20, 'C', 'B'))
# df['grade'] = np.where((df['mpg'] >= 20) & (df['mpg'] <= 29), 'B', df['mpg'])
# df['grade'] = np.where(df['mpg'] < 20, 'C', df['mpg'])
print('df.grade.value_counts()',df.grade.value_counts())
df

df.grade.value_counts() grade
B    118
C    106
A     10
Name: count, dtype: int64

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,mpg,test,grade
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5,OK,B
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0,OK,B
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5,OK,B
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5,OK,B
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0,OK,B
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
229,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,23.5,OK,B
230,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,25.0,OK,B
231,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,21.0,OK,B
232,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,22.0,OK,B
233,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,21.5,OK,B